Функция СменаНаправленияИндикаторовГНЭ(Негатив, Позитив, типПрямой) Экспорт
	Если Не типПрямой Тогда
		Негатив.Заголовок = "▲";
		Позитив.Заголовок = "▼";
		возврат истина;
	Иначе
		Негатив.Заголовок = "▼";
		Позитив.Заголовок = "▲";
		возврат истина;
	КонецЕсли;
	
	возврат ложь;
КонецФункции

Функция СменаЦветаПереключателя(Переключатель, Активный) Экспорт
	Если Не Активный Тогда
		Переключатель.ЦветТекстаЗаголовка = Новый Цвет(51,51,51);
	Иначе
		Переключатель.ЦветТекстаЗаголовка = Новый Цвет(0,114,0);
	КонецЕсли;
КонецФункции
